perf/load-test-intensivo-v2.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # nota: el primer pico de uso de CPU suele ser siempre exagerado, no tenerlo muy en cuenta
  # al final Grafana te replica el ultimo valor, siempre mandar un escenario con arrivalRate 0
  # para visualizar el corte
  # duration: duracion en segundos
  # arrivalRate: request por segundo

  phases:
    - name: 9 request por segundo
      duration: 60
      arrivalRate: 9

    - name: 11 request por segundo
      duration: 60
      arrivalRate: 11

    - name: end
      duration: 10
      arrivalRate: 0

scenarios:
  - name: Intensivo
    flow:
      - get:
          url: '/heavy'