perf/load-test-intensivo-v3.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # nota: el primer pico de uso de CPU suele ser siempre exagerado, no tenerlo muy en cuenta
  # al final Grafana te replica el ultimo valor, siempre mandar un escenario con arrivalRate 0
  # para visualizar el corte
  # duration: duracion en segundos
  # arrivalRate: request por segundo

  phases:
    - name: 15 request por segundo
      duration: 15
      arrivalRate: 15

    - name: 20 request por segundo
      duration: 15
      arrivalRate: 20

    - name: 25 request por segundo
      duration: 15
      arrivalRate: 25

    - name: 29 request por segundo
      duration: 30
      arrivalRate: 29

    - name: end
      duration: 10
      arrivalRate: 0

scenarios:
  - name: Intensivo
    flow:
      - get:
          url: '/heavy'