perf/load-test-ping.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

    black_box:
      target: 'http://localhost:9090'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-black-box"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # nota: el primer pico de uso de CPU suele ser siempre exagerado, no tenerlo muy en cuenta
  # al final Grafana te replica el ultimo valor, siempre mandar un escenario con arrivalRate 0
  # para visualizar el corte
  # duration: duracion en segundos
  # arrivalRate: request por segundo

  phases:
    - name: Plain
      duration: 30
      arrivalRate: 5
    - name: Plain2
      duration: 30
      arrivalRate: 10
    - name: Plain3
      duration: 30
      arrivalRate: 20
    - name: Plain4
      duration: 30
      arrivalRate: 40
    - name: Plain5
      duration: 30
      arrivalRate: 80
    - name: Plain6
      duration: 30
      arrivalRate: 160
    - name: Plain7
      duration: 30
      arrivalRate: 320
    - name: Plain8
      duration: 30
      arrivalRate: 640
    - name: Plain9
      duration: 60
      arrivalRate: 1280
    - name: end
      duration: 30
      arrivalRate: 0

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping' #endponit al que le vas a pegar