perf/load-test-ping_v2.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 10000 # All HTTP requests from all virtual users will be sent over the same connections

  # nota: el primer pico de uso de CPU suele ser siempre exagerado, no tenerlo muy en cuenta
  # al final Grafana te replica el ultimo valor, siempre mandar un escenario con arrivalRate 0
  # para visualizar el corte
  # duration: duracion en segundos
  # arrivalRate: request por segundo

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 20
      rampTo: 100
    - name: Plain
      duration: 30
      arrivalRate: 20
    - name: Plain2
      duration: 30
      arrivalRate: 0
    - name: Plain3
      duration: 10
      arrivalRate: 100
    - name: end
      duration: 30
      arrivalRate: 0

scenarios:
  - name: Ping (/ping)
    flow:
      - get:
          url: '/ping' #endponit al que le vas a pegar